AIRDROP_PICARDIA_COIN = '''
AIRDROP PICARDIA COIN

200 $PICAR  - за каждого вашего бро? 😱
Это топовые условия для крутого AIRDROP'а!

Просто-напросто! Каждый получит DROP от PICARDIA
Нажимай на "условия", чтобы узнать всё! Let's go!'''.strip()

BAlANCE = '''
Информация про твой баланс:

Общий баланс: {} $PICAR
Баланс за рефералы: {} $PICAR
Баланс за задания: {} $PICAR

1 реферал = 200 $PICAR
'''.strip()

WALLET_TEXT = '''
Введи свой кошелек в сети TON и он будет использован для распределения Airdrop-a

ВАЖНО❗️❗️❗️
<b><u>Используйте только некастодиальные кошельки, такие как: Tonkeeper, Tonhub, TonSpace</u></b>

<i>Не используйте кошельки бирж:(<s> Binance, ByBit и тд. </s>)
В противном случае, бонусы начисляться не будут:</i>
'''.strip()

TERMS_AND_CONDITIONALS = '''
Хэй, это инфа по нашим условиям! 📃

Условия участия в AIRDROP просто огонь! 😱
Каждый сможет получить токены $PICAR 🔥

Чтобы быть в игре, вот что нужно сделать:

Подписаться на канал: @{}
Пригласить всех своих бро
За каждого друга ты получишь 200 $PICAR


Приглашай друзей по своей персональной ссылке: {}
Или просто тыкай на кнопку ниже, давай погнали! 👇🏼'''.strip()

TERMS_AND_CONDITIONALS_ENG = '''
Hey, this is information on our terms! 📃

The conditions for participation in AIRDROP are simply amazing! 😱
Everyone can get $PICAR tokens 🔥

To be in the game, here's what to do:

Subscribe to the channel: @{}
Invite all your bros
For every friend you get $200 PICAR


Invite friends using your personal link: {}
Or just click on the button below, let's go! 👇🏼
'''.strip()

SUBSCRIBE_TO_CHANEL = '''
Чтобы участвовать в AIRDROP, Вам необходимо сначала подписаться на канал: @{}
'''.strip()

NEW_REFERRAL_MESSAGE = '''
🚀 Друг присоединился к боту через твою ссылку!

На счету рефералов уже: {}. Классно, продолжай в том же духе!'''.strip()

REFERAL_BONUS = '''
Поздравляем с {} рефералами!

Тебе зачислено {} $PICAR
'''.strip()

REFERAL_NFT_BONUS = '''
Поздравляем!🥳

Ты достиг самого высокого уровня 4! Это действительно впечатляющее достижение, которое заслуживает восхищения.

На твой кошелек будет отправлен бонус НФТ из нашей коллекции
'''.strip()

NO_TASKS_NOW = '''
На данный момент нет заданий, но мы сообщим тебе как только они появятся.
'''.strip()

TASK = '''
Задание номер {}.

<i><u><b>Условие:</b></u></i>
{}
'''.strip()

USE_PROMO = '''
Промокод успешно активирован! +{} $PICAR 💵
'''.strip()

BAD_PROMO = '''
Промокод не действителен 🤷‍♂️
'''.strip()

BUY_PREMIUM = '''
Телеграмм премиум:
Цена: 10.000 $PICAR
'''.strip()